rt/databinding/aegis/src/test/java/org/apache/cxf/aegis/services/base64/binary.xml

<!--
   Licensed to the Apache Software Foundation (ASF) under one
   or more contributor license agreements. See the NOTICE file
   distributed with this work for additional information
   regarding copyright ownership. The ASF licenses this file
   to you under the Apache License, Version 2.0 (the
   "License"); you may not use this file except in compliance
   with the License. You may obtain a copy of the License at

   http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing,
   software distributed under the License is distributed on an
   "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
   KIND, either express or implied. See the License for the
   specific language governing permissions and limitations
   under the License.
-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><verifyDataIntegrity xmlns="http://base64.services.aegis.cxf.apache.org"><data>J6VE/+XTWDdheT9/uzjDAuYjKQQgoASUwV0fBlLHg/7Gslna3pIAlrGWYpcYnkPqVh7AwB4UN4ag
rz2Hs1HlmfVBuQjf6CRUIpJTij5seyMaNbAzB8PgsXvSOi5UeOJfsMii1+U6Cm35b
J6LwK1IMzMabX6hsZIyYQeNDK72/6mw9Nl2yqQ+4CpCOpolVPDNiQb7OQtjvf41b3bdrP2/A2z028zT0miO3IxU
X3f3DQ0Wv4On+sWdTDbbQFsuYDMsgzYuMHkk+reebF1/D16GPWJpxux6FwimVo6W+JENYHtZJ9xBydyT8sXLCY5oHjzXVA
L4xZ
pGsWsth9rqjgEmkAvhJeeCRXSG1dQnrw16PjdSvqSOFJvhE3ZwE0IB
qWTEpHmChvlVVA6OcvDFHwFds0iimM9dl3twABJxETIxhCtvYgqU97g+/GmV/6KqG/N0E1/6XhGV
Zw39EYXn40PcXe7FVbz3ybuPZJtlx5fZxeQe/f7SNyUZ2vv9luUyVxkmuaKz5cY3fUmjavp2L6B1
JEuhyOZECSXIq3rB+TLWXQ2BPg30JeAe53+0Ls0ro6pbh3GakY4y4bB96jpLdYMXzQzs9PGSgf9r
guBmj9pYnQjQZnLAO8x+T1xddzql03H8nWHAPq65yAZyLg6ty1LVJE0xew8QVpFAbqWUNQnExa9v
avJ5mF9aFp5sTg290IMKiFLtc1hi60fPf9AIJZP8rWhePmFgW4zt12RwpAeEgp0iiay211JXDH6q
qhiOUfEKb6ClX5IhqizF/5vz8UY/S/0z5pvmRdYWBjLjtbF0X4ZzZjVm3iMKAN+A8Ni2ZBo3al4a
W2pWJCnKj1hfPvV6UaAVgIsR2GzaKOW7ZVT9X6IYq0tSWQMbHEILnE/Kq8LqBp84oOOOJZHyQDOF
mr7VzC+1R5KpJ/ec+WNJBjwcD3wj0V+1xb6/iYW5YBjPloKENc8gFGQvQN6nm6d/RR5U1jG2Yshe
IAdw9r0M8MbfzGPhxNBt/A==</data><length>757</length><crc32>2247389156</crc32></verifyDataIntegrity></soap:Body></soap:Envelope>